Revit 2024 API
ModelPath.GetProjectGUID Method
 A GUID identifying the BIM 360 Docs or Autodesk Docs project to which the model is associated.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public Guid GetProjectGUID()
Visual Basic
Public Function GetProjectGUID As Guid
Visual C++
public:
Guid GetProjectGUID()
See Also
ModelPath Class
Autodesk.Revit.DB Namespace